name: "postprocess"
backend: "python"
max_batch_size: 16

input [
  {
    name: "post_input"
    data_type: TYPE_FP32
    dims: [ 1000 ]
  }
]

output [
  {
    name: "post_output"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]

instance_group [
  {
      count: 1
      kind: KIND_CPU
  }
]